mgndler2/CH582Duino/cores/CH58x/Arduino.h
/*
  Arduino.h - Main include file for the Arduino SDK
  Copyright (c) 2005-2013 Arduino Team.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef Arduino_h
#define Arduino_h

#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>

#include <pins_arduino.h>
#include "CH583SFR.h"
#include "core_riscv.h"

#ifndef _NOP
#define _NOP() do { __asm__ volatile ("nop"); } while (0)
#endif
typedef uint8_t pin_size_t;

typedef enum {
	LOW = 0,
	HIGH = 1,
	FALLING = 2,
	RISING = 3,
} PinStatus;

typedef enum {
	INPUT = 0x0,
	OUTPUT = 0x1,
	INPUT_PULLUP = 0x2,
	INPUT_PULLDOWN = 0x3,
} PinMode;

typedef enum {
	LSBFIRST = 1,
	MSBFIRST = 0,
} BitOrder;

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus	

#define PI 3.1415926535897932384626433832795
#define HALF_PI 1.5707963267948966192313216916398
#define TWO_PI 6.283185307179586476925286766559
#define DEG_TO_RAD 0.017453292519943295769236907684886
#define RAD_TO_DEG 57.295779513082320876798154814105
#define EULER 2.718281828459045235360287471352

#define SERIAL  0x0
#define DISPLAY 0x1

#define LSBFIRST 1
#define MSBFIRST 0

#define min(a,b) ((a)<(b)?(a):(b))
#define max(a,b) ((a)>(b)?(a):(b))
#define abs(x) ((x)>0?(x):-(x))
#define constrain(amt,low,high) ((amt)<(low)?(low):((amt)>(high)?(high):(amt)))
#define round(x)     ((x)>=0?(long)((x)+0.5):(long)((x)-0.5))
#define radians(deg) ((deg)*DEG_TO_RAD)
#define degrees(rad) ((rad)*RAD_TO_DEG)
#define sq(x) ((x)*(x))

#define interrupts() sei()
#define noInterrupts() cli()

#define clockCyclesPerMicrosecond() ( F_CPU / 1000000L )
#define clockCyclesToMicroseconds(a) ( (a) / clockCyclesPerMicrosecond() )
#define microsecondsToClockCycles(a) ( (a) * clockCyclesPerMicrosecond() )

#define lowByte(w) ((uint8_t) ((w) & 0xff))
#define highByte(w) ((uint8_t) ((w) >> 8))

#define bitRead(value, bit) (((value) >> (bit)) & 0x01)
#define bitSet(value, bit) ((value) |= (1UL << (bit)))
#define bitClear(value, bit) ((value) &= ~(1UL << (bit)))
#define bitToggle(value, bit) ((value) ^= (1UL << (bit)))
#define bitWrite(value, bit, bitvalue) ((bitvalue) ? bitSet(value, bit) : bitClear(value, bit))

	typedef unsigned int word;

#define bit(b) (1UL << (b))

	typedef bool boolean;
	typedef uint8_t byte;
	void init(void);
	void initVariant(void);

	unsigned long millis(void);
	unsigned long micros(void);
	void delay(unsigned long ms);
	void delayMicroseconds(unsigned int us);
	unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout);
	unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout);

	void shiftOut(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder, uint8_t val);
	uint8_t shiftIn(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder);

	void attachInterrupt(uint8_t pin, void (*Func)(void), uint8_t Mode);
	void detachInterrupt(uint8_t interruptNum);

	void setup(void);
	void loop(void);

	// We provide analogReadResolution and analogWriteResolution APIs
	void analogReadResolution(int bits);
	void analogWriteResolution(int bits);

	void pinMode(pin_size_t pin, PinMode mode, bool highPower = false);
	void digitalWrite(pin_size_t pin, PinStatus val);
	PinStatus digitalRead(pin_size_t pin);
	int analogRead(pin_size_t pin, uint8_t gain = 0, uint8_t div = 2);
	//void analogReference(uint8_t mode);
	void analogWrite(pin_size_t pin, int val);
#ifdef __cplusplus
}
#endif // __cplusplus



#ifdef __cplusplus
#include "WCharacter.h"
#include "WString.h"
#include "HardwareSerial.h"
#include "USBAPI.h"
#if defined(HAVE_HWSERIAL0) && defined(HAVE_CDCSERIAL)
#error "Targets with both UART0 and CDC serial not supported"
#endif

uint16_t makeWord(uint16_t w);
uint16_t makeWord(byte h, byte l);


unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);
unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);

void tone(uint8_t _pin, unsigned int frequency, unsigned long duration = 0);
void noTone(uint8_t _pin);

// WMath prototypes
long random(long);
long random(long, long);
void randomSeed(unsigned long);
long map(long, long, long, long, long);

#endif




#endif